{"format": "graph-model", "generatedBy": "2.16.2", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "768"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/add_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/Cast_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayUnstack_1/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/add_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/Cast_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/masking_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/masking_1/Any/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/Any/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/ReverseV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayUnstack_1/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "768"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/masking_1/NotEqual", "op": "NotEqual", "input": ["inputs", "StatefulPartitionedCall/sequential_1/masking_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1/NotEqual", "op": "NotEqual", "input": ["inputs", "StatefulPartitionedCall/sequential_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1/masking_1/Any", "op": "Any", "input": ["StatefulPartitionedCall/sequential_1/masking_1/NotEqual", "StatefulPartitionedCall/sequential_1/masking_1/Any/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1/Any", "op": "Any", "input": ["StatefulPartitionedCall/sequential_1/NotEqual", "StatefulPartitionedCall/sequential_1/Any/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/masking_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/masking_1/Any"], "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_1/Any", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_1/Any", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential_1/masking_1/mul", "op": "Mul", "input": ["inputs", "StatefulPartitionedCall/sequential_1/masking_1/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/ExpandDims", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-18"}, {"size": "1"}]}, {"dim": [{"size": "3"}]}]}}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/ExpandDims", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-5"}, {"size": "-19"}, {"size": "1"}]}, {"dim": [{"size": "3"}]}]}}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_1/masking_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_1/masking_1/mul", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-9"}, {"size": "-20"}, {"size": "768"}]}, {"dim": [{"size": "3"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_1/masking_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_1/masking_1/mul", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-9"}, {"size": "-20"}, {"size": "768"}]}, {"dim": [{"size": "3"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayUnstack_1/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/transpose_1", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayUnstack_1/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_BOOL"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_BOOL"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/ReverseV2_1", "op": "ReverseV2", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/transpose_1", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/ReverseV2_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/Shape", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice/stack", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/transpose", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice_2/stack", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice_2/stack_1", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/transpose", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/Shape", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice/stack", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/transpose", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice_2/stack", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice_2/stack_1", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/ReverseV2", "op": "ReverseV2", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/transpose", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/ReverseV2/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayUnstack_1/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/ReverseV2_1", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayUnstack_1/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_BOOL"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_BOOL"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/ReverseV2", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros/packed", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros_1/packed", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros/packed", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros_1/packed", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/Cast_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-22"}, {"size": "128"}]}, {"dim": [{"size": "128"}, {"size": "512"}]}]}}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/Cast_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-33"}, {"size": "128"}]}, {"dim": [{"size": "128"}, {"size": "512"}]}]}}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/add_1/ReadVariableOp", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/add_1/ReadVariableOp", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/add_1", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice_2", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/add"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-24"}, {"size": "768"}]}, {"dim": [{"size": "768"}, {"size": "512"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/add_1", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice_2", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/add"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-33"}, {"size": "768"}]}, {"dim": [{"size": "768"}, {"size": "512"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/split", "op": "Split", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/split/split_dim", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/add_1"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/split", "op": "Split", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/split/split_dim", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/add_1"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/split"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-24"}, {"size": "128"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/split:1"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-24"}, {"size": "128"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/split:3"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-24"}, {"size": "128"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/Sigmoid_1", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/Sigmoid", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/Sigmoid_1", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/Sigmoid", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/mul", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/mul", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/Sigmoid_2", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/Sigmoid_2", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros_like", "op": "ZerosLike", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/lstm_cell_1/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros_like", "op": "ZerosLike", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/lstm_cell_1/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while", "op": "While", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while/loop_counter", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/Max", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/time", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayV2_1", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros_like", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/zeros_1", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayUnstack/TensorListFromTensor", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayUnstack_1/TensorListFromTensor", "unknown", "unknown_0", "unknown_1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "cond": {"func": {"name": "__inference_sequential_1_bidirectional_1_forward_lstm_1_while_cond_435_frozen_1125"}}, "_lower_using_switch_merge": {"b": false}, "_num_original_outputs": {"i": "12"}, "parallel_iterations": {"i": "32"}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_VARIANT", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "body": {"func": {"name": "__inference_sequential_1_bidirectional_1_forward_lstm_1_while_body_436_frozen_1127"}}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "128"}]}, {"dim": [{"size": "-1"}, {"size": "128"}]}, {"dim": [{"size": "-1"}, {"size": "128"}]}, {}, {}, {"dim": [{"size": "768"}, {"size": "512"}]}, {"dim": [{"size": "128"}, {"size": "512"}]}, {"dim": [{"size": "512"}]}]}}, "_read_only_resource_inputs": {"list": {"i": ["9", "10", "11"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while", "op": "While", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while/loop_counter", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/Max", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/time", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayV2_1", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros_like", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/zeros_1", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayUnstack/TensorListFromTensor", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayUnstack_1/TensorListFromTensor", "unknown_2", "unknown_3", "unknown_4"], "attr": {"_has_manual_control_dependencies": {"b": true}, "cond": {"func": {"name": "__inference_sequential_1_bidirectional_1_backward_lstm_1_while_cond_613_frozen_1124"}}, "_lower_using_switch_merge": {"b": false}, "parallel_iterations": {"i": "32"}, "_num_original_outputs": {"i": "12"}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT", "DT_VARIANT", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "body": {"func": {"name": "__inference_sequential_1_bidirectional_1_backward_lstm_1_while_body_614_frozen_1126"}}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "128"}]}, {"dim": [{"size": "-1"}, {"size": "128"}]}, {"dim": [{"size": "-1"}, {"size": "128"}]}, {}, {}, {"dim": [{"size": "768"}, {"size": "512"}]}, {"dim": [{"size": "128"}, {"size": "512"}]}, {"dim": [{"size": "512"}]}]}}, "_read_only_resource_inputs": {"list": {"i": ["9", "10", "11"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/while:3", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/while:3", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice_3", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice_3/stack", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice_3/stack_1", "StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice_3/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice_3", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice_3/stack", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice_3/stack_1", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice_3/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/bidirectional_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/forward_lstm_1/strided_slice_3", "StatefulPartitionedCall/sequential_1/bidirectional_1/backward_lstm_1/strided_slice_3", "StatefulPartitionedCall/sequential_1/bidirectional_1/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Sigmoid", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/bidirectional_1/concat", "StatefulPartitionedCall/sequential_1/dense_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "U2lnbW9pZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/dense_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {"function": [{"signature": {"name": "__inference_sequential_1_bidirectional_1_forward_lstm_1_while_body_436_frozen_1127", "inputArg": [{"name": "sequential_1_bidirectional_1_forward_lstm_1_while_sequential_1_bidirectional_1_forward_lstm_1_while_loop_counter", "type": "DT_INT32"}, {"name": "sequential_1_bidirectional_1_forward_lstm_1_while_sequential_1_bidirectional_1_forward_lstm_1_max", "type": "DT_INT32"}, {"name": "sequential_1_bidirectional_1_forward_lstm_1_while_placeholder", "type": "DT_INT32"}, {"name": "sequential_1_bidirectional_1_forward_lstm_1_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "sequential_1_bidirectional_1_forward_lstm_1_while_placeholder_2", "type": "DT_FLOAT"}, {"name": 